

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Асинх Процедура ДЗ_СогласованнаяСкидкаПриИзменении(Элемент)
		
	//++Ильин : Добовление вопроса при изменение процента скидки.Пересчитать таблицу товаров и услуг?
	
	ТекстВопроса = "Изменен процент скидки.Пересчитать таблицу товаров и услуг?";
	
	Ответ = Ждать ВопросАсинх(ТекстВопроса,РежимДиалогаВопрос.ДаНет);
	Если Ответ = КодВозвратаДиалога.Да Тогда
		
		ПересчитатьТовар();
		
		ПересчитатьУслуги();
		
	КонецЕсли;
	
	//--Ильин
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТовары

&НаКлиенте
Процедура ТоварыКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура ТоварыПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

&НаКлиенте
Процедура ТоварыСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Товары.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыУслуги

&НаКлиенте
Процедура УслугиКоличествоПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиЦенаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиСкидкаПриИзменении(Элемент)
	
	ТекущиеДанные = Элементы.Услуги.ТекущиеДанные;
	
	РассчитатьСуммуСтроки(ТекущиеДанные);
	
КонецПроцедуры

&НаКлиенте
Процедура УслугиПриИзменении(Элемент)
	РассчитатьСуммуДокумента();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПересчитатьТаблицуФормы(Команда)
	
	//++Ильин : Добовление команды пересчитать таблицу
	
	ПересчитатьТовар();
	
	ПересчитатьУслуги();
	
	//--Ильин

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура РассчитатьСуммуСтроки(ТекущиеДанные)
	
	//++Ильин 
	//Новый код
	//Добовление пересчета при согласованная скидка и сумма скидки
	
	РассчитатьСуммуИСкидку(ТекущиеДанные);
	
	//Исходный код
	//КоэффициентСкидки = 1 - ТекущиеДанные.Скидка / 100;
	//ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество * КоэффициентСкидки;
	
	// Нет в новой версии 1.0.0.7 процедуры РассчитатьСуммуДокумента()
	//Добавлено для расчета суммы документа
	
	РассчитатьСуммуДокумента()
	
	//--Ильин
	
КонецПроцедуры

&НаКлиенте
Процедура РассчитатьСуммуДокумента()
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Сумма") + Объект.Услуги.Итог("Сумма");
	
КонецПроцедуры



#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#КонецОбласти


#Область Дороботки 

&НаКлиенте
Процедура ПересчитатьТовар()
	
	//++Ильин : Добовление команды пересчитать таблицу
	//Пересчет таблицы товары
	
	ТабОбхода =  Объект.Товары;
	
	ПересчитатьТаблицу(ТабОбхода);
	
	//--Ильин
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьТаблицу(ТабОбхода)
	
	//++Ильин : Добовление команды пересчитать таблицу
	//Пересчет таблицы товары и услуги с учетом скидок
	
	Для Каждого ТекущиеДанные из ТабОбхода Цикл
		
		РассчитатьСуммуИСкидку(ТекущиеДанные)
		
	КонецЦикла;
	
	//--Ильин
	
КонецПроцедуры

&НаКлиенте
Процедура ПроверкаСкидкиТекущихДанных(Скидка,СогласованнаяСкидка,ТекущиеДанные)
	
	//--Ильин
	//Добовление проверки для скидки 
	
	Если СогласованнаяСкидка + Скидка > 100 Тогда
		
		ПоказатьПредупреждение(,"Скидка превышает 100%",,"Общая скидка");
		
	КонецЕсли;
	
	Если ТекущиеДанные.Сумма < 0 Тогда
		
		ТекущиеДанные.Сумма = 0;
		
	КонецЕсли;
	
	//--Ильин
	
КонецПроцедуры

&НаКлиенте
Процедура ПересчитатьУслуги()
	
	//++Ильин : Добовление команды пересчитать таблицу
	//Пересчет таблицы услуги
	
	ТабОбхода =  Объект.Услуги;
	
	ПересчитатьТаблицу(ТабОбхода);
	
	//--Ильин
	
КонецПроцедуры


&НаКлиенте
Процедура РассчитатьСуммуИСкидку(ТекущиеДанные)
	
	//++Ильин 
	//Рефакторинг для расчета суммы и скидки
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Цена * ТекущиеДанные.Количество;
	
	СогласованнаяСкидка = Объект.ДЗ_СогласованнаяСкидка;
	
	СуммаСогласованнойСкидки = ТекущиеДанные.Сумма/100 * СогласованнаяСкидка;
	
	Скидка = ТекущиеДанные.Скидка;
	
	СуммаСкидки = ТекущиеДанные.Сумма/100 * Скидка;
	
	ОбщаяСкидка = СуммаСогласованнойСкидки + СуммаСкидки;
	
	ТекущиеДанные.Сумма = ТекущиеДанные.Сумма - ОбщаяСкидка;
	
	ПроверкаСкидкиТекущихДанных(Скидка,СогласованнаяСкидка,ТекущиеДанные);
	
	//--Ильин
	
КонецПроцедуры


#КонецОбласти 
